// Laba.cpp: определяет точку входа для консольного приложения.
//
#include "stdafx.h"
//#include "pch.h" 
#include <iostream>
#include <iomanip>

using namespace std;

int test (int a, int n){
	if(a==0){
      a=n;
	  return a;
	}
	else
		return a;
}
int main()
{
	setlocale(LC_ALL, "RUS");
	char M_1[14][14];
	int M[14][14] = {{-2,-2,-2,-2,-2,-2,-2,1-2,-2,-2,-2,-2,-2,-2},
	                    {-2,0,0,0,0,-1,0,0,0,0,-1,0,0,-2},
	                    {-2,0,-1,-1,-1,-1,0,0,0,0,-1,0,0,-2},
	                    {-2,0,0,-1,0,-1,-1,0,0,-1,0,0,0,-2},
	                    {-2,0,0,-1,-1,-1,-1,0,0,0,0,0,0,-2},
	                    {-2,0,-1,-1,-1,0,-1,-1,0,0,-1,-1,-1,-2},
	                    {-2,0,-1,0,0,0,0,0,0,0,-1,0,0,-2},
	                    {-2,0,0,0,-1,-1,-1,-1,-1,0,0,0,0,-2},
	                    {-2,0,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-2},
	                    {-2,0,0,0,-1,-1,0,-1,-1,-1,-1,-1,0,-2},
	                    {-2,0,-1,0,0,0,0,0,0,0,-1,0,0,-2},
	                    {-2,0,-1,0,-1,0,0,0,0,0,-1,0,0,-2},
	                    {-2,0,0,0,0,-1,0,0,0,0,0,0,0,-2},
	                    {-2,-2,-2,-2,-2,-2,-2,1-2,-2,-2,-2,-2,-2,-2}};
	int i, i_1;
	do {
		do {
			cout << "Введите координату Y для А:" << endl;
			cin >> i;
		} while (i < 1 || i >12);
		do {
			cout << "Введите координату X для А" << endl;
			cin >> i_1;
		} while (i_1 < 1 || i_1 >12);
	} while (M[i][i_1] == -1);
	M[i][i_1] = -4;

	for (int i = 1; i < 13; i++) {
		for (int i_1 = 1; i_1 < 13; i_1++) {
			if(M[i][i_1]==-1 || M[i][i_1]==-4 || M[i][i_1]==-9 || M[i][i_1]==0 ||M[i][i_1]==-12  ){
				
				if(M[i][i_1]==-1){
					M_1[i][i_1]='#';
              cout << setw(3)<< M_1[i][i_1];
			}
				if(M[i][i_1]==-12){
					M_1[i][i_1]='*';
              cout << setw(3)<< M_1[i][i_1];
			}
            if(M[i][i_1]==0){
					M_1[i][i_1]='-';
              cout << setw(3)<< M_1[i][i_1];
			}		
			if(M[i][i_1]==-4){
              M_1[i][i_1]='A';
              cout << setw(3)<< M_1[i][i_1];
			}
            if(M[i][i_1]==-9){
              M_1[i][i_1]='B';
              cout << setw(3)<< M_1[i][i_1];
			}}

			else{
				cout << setw(3)<< M[i][i_1];}
			if (i_1 == 12) {
				cout << endl;
			}	
		}
}
    
	int a = i;
	int b = i_1;
	int a_3 = i;
	int b_3 = i_1;

	do {
		do {
			cout << "Введите координату Y для B:" << endl;
			cin >> i;
		} while (i < 1 || i >12);
		do {
			cout << "Введите координату X для B" << endl;
			cin >> i_1;
		} while (i_1 < 1 || i_1 >12);
	} while (M[i][i_1] == -1 || M[i][i_1] ==-4  );
    M[i][i_1] = -9;
	int a_1 = i;
	int b_1 = i_1;
	int a_2 = i;
	int b_2 = i_1;
    for (int i = 1; i < 13; i++) {
		for (int i_1 = 1; i_1 < 13; i_1++) {
			if(M[i][i_1]==-1 || M[i][i_1]==-4 || M[i][i_1]==-9 || M[i][i_1]==0){
				
				if(M[i][i_1]==-1){
					M_1[i][i_1]='#';
              cout << setw(3)<< M_1[i][i_1];
			}
			
			if(M[i][i_1]==-4){
              M_1[i][i_1]='A';
              cout << setw(3)<< M_1[i][i_1];
			}
			if(M[i][i_1]==0){
              M_1[i][i_1]='-';
              cout << setw(3)<< M_1[i][i_1];
			}
            if(M[i][i_1]==-9){
              M_1[i][i_1]='B';
              cout << setw(3)<< M_1[i][i_1];
			}}

			else{
				cout << setw(3)<< M[i][i_1];}
			if (i_1 == 12) {
				cout << endl;
			}		
		}
	}
	int n_4 = 0;
	if (M[a_3][b_3 + 1]==-9|| M[a_3 - 1][b_3]==-9 ||  M[a_3+ 1][b_3] ==-9|| M[a_3][b_3 - 1]==-9){
		 n_4=1;

	}
	if(n_4==0){
		int n=1;
	M[a][b + 1] = test(M[a][b + 1],n);
	M[a - 1][b] = test(M[a - 1][b],n);
	M[a + 1][b] = test(M[a + 1][b],n);
	M[a][b - 1] = test(M[a][b - 1],n);
	int q=0;
	if(M[a_3][b_3 - 2]==-9 ||M[a_3][b_3 +2]==-9|| M[a_3 + 2][b_3]==-9 ||M[a_3 -2][b_3]==-9 || M[a_3 - 1][b_3+1]==-9 ||M[a_3 - 1][a_3-1]==-9  || M[a_3+1][b_3 + 1]==-9 ||M[b_3+1][b_3 -1]==-9 ){
	}
	else{
	int n_1=2;
	do{
	for (int i = 1; i < 13; i++) {
		for (int i_1 = 1; i_1 < 13; i_1++) {
			
			if(M[i][i_1]==n){
				
             M[i][i_1 + 1] = test(M[i][i_1 + 1] ,n_1);
	         M[i - 1][i_1] = test(M[i - 1][i_1],n_1);
	         M[i + 1][i_1] = test(M[i + 1][i_1],n_1);
	         M[i][i_1 - 1] = test(M[i][i_1 - 1],n_1);
			 if (M[a_1][b_1 + 1]>0 || M[a_1 - 1][b_1]>0 ||  M[a_1+ 1][b_1] >0 || M[a_1][b_1 - 1]>0 ){
				 q=101;
                     }
		      }
		}	
	}
	n_1++;
	n++;
	q++;
	} while(q<100);
	}}
cout << endl;
 for (int i = 1; i < 13; i++) {
		for (int i_1 = 1; i_1 < 13; i_1++) {
			if(M[i][i_1]==-1 || M[i][i_1]==-4 || M[i][i_1]==-9 || M[i][i_1]==0){
				
				if(M[i][i_1]==-1){
					M_1[i][i_1]='#';
              cout << setw(3)<< M_1[i][i_1];
			}
			if(M[i][i_1]==-4){
              M_1[i][i_1]='A';
              cout << setw(3)<< M_1[i][i_1];
			}
			if(M[i][i_1]==0){
              M_1[i][i_1]='-';
              cout << setw(3)<< M_1[i][i_1];
			}
            if(M[i][i_1]==-9){
              M_1[i][i_1]='B';
              cout << setw(3)<< M_1[i][i_1];
			}}
			else{
				cout << setw(3)<< M[i][i_1];}
			if (i_1 == 12) {
				cout << endl;
			}
			
		}
	}         
     i=a_2;
	 i_1=b_2;
	 int n_1=100;
	 for (int i_2=0;i_2<150;i_2++){		
					if(M[i][i_1 + 1]==-4 || M[i - 1][i_1]==-4 || M[i + 1][i_1]==-4 || M[i][i_1 - 1]==-4){
						break;
					}
					if(i_2==149){
						cout<<"Пути нет"<<endl;
						return 0;
					}
			if(M[i][i_1 + 1]<n_1 && M[i][i_1 + 1]>0  ){
				    
                    n_1=M[i][i_1 + 1];
					M[i][i_1 + 1]=-12;
					 i_1=i_1+1;
							
					}
			if(M[i - 1][i_1]<n_1 && M[i - 1][i_1]>0  ){
					n_1=M[i - 1][i_1];
                      M[i - 1][i_1]=-12;
					i=i-1;
				}
	        if(M[i + 1][i_1]<n_1 && M[i + 1][i_1]>0 ){
					n_1=M[i + 1][i_1];
					M[i + 1][i_1]=-12;
					i=i+1;
				}
			if (M[i][i_1 - 1]<n_1 && M[i][i_1 - 1]>0 ){
				  
					n_1=M[i][i_1 - 1];
					M[i][i_1 - 1]=-12;
					i_1=i_1-1;			
	  }
	 }				
  cout << endl;
for (int i = 1; i < 13; i++) {
		for (int i_1 = 1; i_1 < 13; i_1++) {
			if(M[i][i_1]==-1 || M[i][i_1]==-4 || M[i][i_1]==-9 || M[i][i_1]==0 ||M[i][i_1]==-12 || M[i][i_1]>0  ){
				
				if(M[i][i_1]==-1){
					M_1[i][i_1]='#';
              cout << setw(3)<< M_1[i][i_1];
			}
				if(M[i][i_1]>0){
					M_1[i][i_1]='-';
              cout << setw(3)<< M_1[i][i_1];
			}
				if(M[i][i_1]==-12){
					M_1[i][i_1]='*';
              cout << setw(3)<< M_1[i][i_1];
			}
            if(M[i][i_1]==0){
					M_1[i][i_1]='-';
              cout << setw(3)<< M_1[i][i_1];
			}	
			if(M[i][i_1]==-4){
              M_1[i][i_1]='A';
              cout << setw(3)<< M_1[i][i_1];
			}
            if(M[i][i_1]==-9){
              M_1[i][i_1]='B';
              cout << setw(3)<< M_1[i][i_1];
			}}

			else{
				cout << setw(3)<< M[i][i_1];}
			if (i_1 == 12) {
				cout << endl;
			}	
		}
}
}

